Ile interfejsów FastEthernet ma przełącznik 2960? -  					24porty
Ile interfejsów Gigabit Ethernet posiada przełącznik 2960? - 				2porty
Jaki jest zakres wartości linii vty? - 							0-4, 5-15

c. Sprawdź plik konfiguracji startowej w NVRAM. - 					startup-config is not present
Dlaczego pojawia się ten komunikat? - 							Ponieważ nie ma zapisanej żadnej konfiguracji 

d. Zbadaj właściwości SVI dla VLAN 1.							show interfaces Vlan 1

Czy istnieje adres IP przypisany do sieci VLAN 1?					nie istnieje
Jaki jest adres MAC tego SVI? Odpowiedzi mogą być różne.				0010.112d.d0ca
Czy interfejs ten jest aktywny (up)?							nie jest aktywny

e. Sprawdź właściwości IP dla SVI VLAN 1.						show ip interface Vlan 1

Co widzisz po użyciu tej komendy?							komunikat Vlan1 nie działa

f. Podłącz kabel Ethernet z PC-A do portu 6 na przełączniku i sprawdź właściwości IP dla SVI VLAN 1.
Poczekaj, aż przełącznik i komputer PC wynegocjują parametry dupleksu i szybkości.
Uwaga: Jeśli używasz Netlab, włącz interfejs F0/6 na S1.
Pytanie:
Co widzisz po użyciu tej komendy?							

g. Zbadaj informacje o wersji Cisco IOS przełącznika.
Pytania:
Jaka wersja systemu Cisco IOS jest wykorzystywana w przełączniku?			Version 15.0(2)SE4
Jaka jest nazwa pliku obrazu systemu?							Cisco IOS Software, C2960 Software
Jaki jest podstawowy adres MAC przełącznika?						00:10:11:2D:D0:CA
	
h.Sprawdź domyślne właściwości interfejsu FastEthernet używanego przez PC-A.		Switch# show interface f0/6
Pytanie:
Czy interfejs jest włączony, czy wyłączony?						jest włączony, protokół linii jest włączony				
Jakie zdarzenie mogłoby spowodować włączenie interfejsu?				podłączenie komputera
Jaki jest adres MAC interfejsu?								00d0.d3da.9006
Jakie są ustawienia dotyczące szybkości i trybu dupleksu na interfejsie?		Pełny dupleks, 100 Mb/s

i. Sprawdź domyślne ustawienia sieci VLAN przełącznika.
Pytanie:
Jaka jest nazwa sieci VLAN 1?								default
Które porty znajdują się w sieci VLAN 1?						Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                               						Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                					Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                					Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                					Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                					Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                					Gig0/1, Gig0/2
Czy sieć VLAN 1 jest aktywna?								domyślnie aktywny 
Jaki jest typ domyślnej sieci VLAN?

j. Sprawdź zawartość pamięci flash.
Użyj jednego następującego polecenia, aby zbadać zawartość katalogu pamięci flash:
Switch# show flash
Switch# dir flash:
Pliki posiadają rozszerzenia takie jak np. .bin, na końcu nazwy. Wyświetlane katalogi nie posiadają
rozszerzeń.
Pytanie:
Jaka jest nazwa pliku obrazu Cisco IOS?							2960-lanbasek9-mz.150-2.SE4.bin			


Sprawdź ustawienia VLAN 99 do zarządzania.
S1# show interface vlan 99
Pytania:
Jaka jest szerokość pasma tego interfejsu?						
Jaki jest stan VLAN 99?									działa
Jaki jest stan protokołu linii?								protokół linii działa

Wyświetl adresy MAC za pomocą komendy show mac-address-table.
S1# show mac address-table
Ile adresów dynamicznych zawiera tablica?						1
Ile łącznie adresów MAC zawiera tablica?						1
Czy dynamiczny adres MAC pasuje do adresu MAC PC-A?					Tak

Pokaż opcje polecenia show mac adress-table.
S1# show mac address-table ?
Ile opcji jest dostępnych dla polecenia show mac address-table?				3

Wydaj polecenie show mac address-table dynamic, aby wyświetlić tylko adresy MAC, które zostały
zapamiętane dynamicznie.
S1# show mac address-table dynamic
Ile adresów dynamicznych zawiera tablica?						1

Sprawdź czy została wyczyszczona tablica adresów MAC.
S1# show mac address-table
Ile jest statycznych adresów MAC?							0
Ile adresów dynamicznych zawiera tablica?						0

Najprawdopodobniej aplikacja działająca na twoim komputerze wysłała już ramkę z karty sieciowej do S1.
Spójrz ponownie na tablicę adresów MAC w uprzywilejowanym trybie EXEC, aby sprawdzić, czy S1
ponownie nauczył się adresu MAC komputera PC-A.
S1# show mac address-table
Ile adresów dynamicznych zawiera tablica?						0
Dlaczego wyświetlone dane różnią się od danych wyświetlonych uprzednio?

Sprawdź wpisy w tabeli adresów MAC.
S1# show mac address-table
Ile łącznie adresów MAC zawiera tablica?						1
Ile adresów statycznych zawiera tablica?						1

Sprawdź, czy statyczny adres MAC został wyczyszczony.
S1# show mac address-table
Ile znajduje się wniej obecnie wszystkich adresów MAC?					0

Pytania refleksyjne
1. Dlaczego warto skonfigurować hasło vty dla przełącznika?				aby działały połączenia telnet
	
2. Dlaczego zmienić domyślną VLAN 1 na inny numer VLAN?					w celu bezpieczeństwa sieci

3. Jak można zapobiec wyświetlaniu haseł jako jawny tekst?				użyć komendy szyfrowania 

4. Dlaczego skonfigurować statyczny adres MAC na interfejsie portu?			statyczny adres MAC określa jaki sprzęt jest domyślnie skonfigurowany pod wskazanym portem 



Terminal Switch

POST: CPU MIC interface Loopback Tests : Begin
POST: CPU MIC interface Loopback Tests : End, Status Passed
POST: PortASIC RingLoopback Tests : Begin
POST: PortASIC RingLoopback Tests : End, Status Passed
POST: PortASIC CAM Subsystem Tests : Begin
POST: PortASIC CAM Subsystem Tests : End, Status Passed
POST: PortASIC Port Loopback Tests : Begin
POST: PortASIC Port Loopback Tests : End, Status Passed
Waiting for Port download...Complete

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.
A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
If you require further assistance please contact us by sending email to
export@cisco.com.
cisco WS-C2960-24TT-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
Processor board ID FOC1010X104
Last reset from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.
64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:10:11:2D:D0:CA
Motherboard assembly number     : 73-10390-03
Power supply part number        : 341-0097-02
Motherboard serial number       : FOC10093R12
Power supply serial number      : AZS1007032H
Model revision number           : B0
Motherboard revision number     : B0
Model number                    : WS-C2960-24TT-L
System serial number            : FOC1010X104
Top Assembly Part Number        : 800-27221-02
Top Assembly Revision Number    : A0
Version ID                      : V02
CLEI Code Number                : COM3L00BRA
Hardware Board Revision Number  : 0x01

Switch Ports Model              SW Version            SW Image
------ ----- -----              ----------            ----------
*    1 26    WS-C2960-24TT-L    15.0(2)SE4            C2960-LANBASEK9-M

Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 26-Jun-13 02:49 by mnguyen



Press RETURN to get started!


%LINK-5-CHANGED: Interface FastEthernet0/6, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/6, changed state to up


Switch>enable
Switch#config
Switch#configure t
Switch#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#no ip domain-lookup
Switch(config)#hostname S1
S1(config)#service password-encryption
S1(config)#enable secret class
S1(config)#banner motd #
Enter TEXT message.  End with the character '#'.
Unauthorized access is strictly prohibited. #

S1(config)#no 
S1(config)#no ip
S1(config)#no ip do
S1(config)#no ip dom
S1(config)#no ip domain
S1(config)#no ip ?
  access-list      Named access-list
  arp              IP ARP global configuration
  default-gateway  Specify default gateway (if not routing IP)
  dhcp             Configure DHCP server and relay parameters
  domain           IP DNS Resolver
  domain-lookup    Enable IP Domain Name System hostname translation
  domain-name      Define the default domain name
  ftp              FTP configuration commands
  hosts            Add an entry to the ip hostname table
  name-server      Specify address of name server to use
  scp              Scp commands
  ssh              Configure ssh options
S1(config)#no ip domain
S1(config)#no ip domain-l
S1(config)#no ip domain-lookup 
S1(config)#vlan 99
S1(config-vlan)#exit
S1(config)#interface vlan99
S1(config-if)#
%LINK-5-CHANGED: Interface Vlan99, changed state to up

S1(config-if)#ip addre
S1(config-if)#ip address 192.168.1.2 255.255.255.0
S1(config-if)#no sh
S1(config-if)#no shutdown 
S1(config-if)#exit
S1(config)#int
S1(config)#interface rang
S1(config)#interface range f
S1(config)#interface range f
S1(config)#interface range f0/1 - 24,g0/1 - 2
S1(config-if-range)#swi
S1(config-if-range)#switchport a
S1(config-if-range)#switchport access v
S1(config-if-range)#switchport access vlan 99
S1(config-if-range)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan99, changed state to up

S1(config-if-range)#exit
S1(config)#exit
S1#
%SYS-5-CONFIG_I: Configured from console by console

S1#show 
S1#show int
S1#show interfaces v
S1#show interfaces vlan 99
Vlan99 is up, line protocol is up
  Hardware is CPU Interface, address is 0010.112d.d001 (bia 0010.112d.d001)
  Internet address is 192.168.1.2/24
  MTU 1500 bytes, BW 100000 Kbit, DLY 1000000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 21:40:21, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1682 packets input, 530955 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicast)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     563859 packets output, 0 bytes, 0 underruns
     0 output errors, 23 interface resets
     0 output buffer failures, 0 output buffers swapped out

S1#sh
S1#show v
S1#show vl
S1#show vlan b
S1#show vlan brief 

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    
99   VLAN0099                         active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
S1#
S1#con
S1#co
S1#conf
S1#configure t
Enter configuration commands, one per line.  End with CNTL/Z.
S1(config)#ip de
S1(config)#ip default-gateway 192.168.1.1
S1(config)#line con
S1(config)#line console 0
S1(config-line)#pass
S1(config-line)#password cisco
S1(config-line)#lo
S1(config-line)#log
S1(config-line)#logi
S1(config-line)#login 
S1(config-line)#logg
S1(config-line)#logging sy
S1(config-line)#logging synchronous 
S1(config-line)#exit
S1(config)# line
S1(config)# line vty
S1(config)# line vty 0 15
S1(config-line)#passw
S1(config-line)#password cisco
S1(config-line)#logi
S1(config-line)#login 
S1(config-line)#exit
S1(config)#


C:\>telnet 192.168.1.2
Trying 192.168.1.2 ...Open
Unauthorized access is strictly prohibited. 


User Access Verification

Password: 
S1>

S1#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
S1#

S1#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

  99    0004.9a7b.4a94    DYNAMIC     Fa0/6
S1#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

  99    0004.9a7b.4a94    DYNAMIC     Fa0/6
S1#show mac address-table ?
  dynamic     dynamic entry type
  interfaces  interface entry type
  static      static entry type
  <cr>
S1#show mac address-table d
S1#show mac address-table dynamic 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

  99    0004.9a7b.4a94    DYNAMIC      Fa0/6
S1#show 
S1#show ma
S1#show mac
S1#show mac a
S1#show mac address-table a
S1#show mac address-table ad
S1#show mac address-table add
S1#show mac address-table addr
S1#show mac address-table address
S1#show mac address-table address ?
% Unrecognized command
S1#show mac address-table address?
% Unrecognized command
S1#show mac address-table address 0004.9a7b.4a94
                          ^
% Invalid input detected at '^' marker.
	
S1#show mac address-table ?
  dynamic     dynamic entry type
  interfaces  interface entry type
  static      static entry type
  <cr>
S1#show mac address-table 0004.9a7b.4a94
                          ^
% Invalid input detected at '^' marker.
	
S1#clear mac 
S1#clear mac address-table dyn
S1#clear mac address-table dynamic 
S1#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

S1#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

  99    0004.9a7b.4a94    DYNAMIC     Fa0/6
S1#mac address-table static 0050.56BE.6C89 vlan 99 interface
       ^
% Invalid input detected at '^' marker.
	
S1#fastethernet 0/6
                ^
% Invalid input detected at '^' marker.
	
S1#conf
S1#configure t
Enter configuration commands, one per line.  End with CNTL/Z.
S1(config)#mac a
S1(config)#mac address-table  s
S1(config)#mac address-table  static 0004.9a7b.4a94 vl
S1(config)#mac address-table  static 0004.9a7b.4a94 vlan 99 in
S1(config)#mac address-table  static 0004.9a7b.4a94 vlan 99 interface f
S1(config)#mac address-table  static 0004.9a7b.4a94 vlan 99 interface fastEthernet 0/6
S1(config)#exit
S1#
%SYS-5-CONFIG_I: Configured from console by console

S1#sh
S1#show mac
S1#show mac 
S1#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

  99    0004.9a7b.4a94    STATIC      Fa0/6
S1#configure t
Enter configuration commands, one per line.  End with CNTL/Z.
S1(config)#no mac address-table  static 0004.9a7b.4a94 vlan 99 interface fastEthernet 0/6
S1(config)#exit
S1#
%SYS-5-CONFIG_I: Configured from console by console

S1#show mac address-table 
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----

S1#


